app/views/users/scoreboard.html.erb

				<td>Yes/No</td>
				<% if p.user.md_id.present? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1