app/controllers/api/v1/challenges_controller.rb

  def index
    @user =  User.find(params[:user_id]) if params[:user_id].present?
    @challenges = Challenge.where("is_published = ?", true)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `challenges`.* FROM `challenges` WHERE (is_published = 1)