app/controllers/api/v1/mini_challenges_controller.rb

  def create
  	mini_challenge_id = params[:mini_challenge][:mini_challenge_id]
  	option = params[:mini_challenge][:option]
  	if mini_challenge_id.present? && option.present?
  		if MiniChallengeAnswer.where("user_id = ? and mini_challenge_id = ?", @current_user.id, mini_challenge_id).present?
  			render_json({message: "Opps.. You Already Given Answer!. so you can't do again", status: 200}.to_json)
  		else
  			@mc = MiniChallenge.find(mini_challenge_id)
  			@mini_answer = MiniChallengeAnswer.new(mini_challenge_params)
  			@mini_answer.user_id = @current_user.id
  			@mini_answer.save
        ActivityFeed.create(:message => "Recently participate in #{@mc.title} mini challenge!", :user_id => @current_user.id )
        RecentActivity.create(:user_id => @current_user.id, :rc_type => "mini_player_challenge", :message => "Recently post in #{@mc.title} mini challenge")
  			@options = @mc.challenge_options.where("answer = ?", true)
  			if @options.present?
  				current_answer = @options.first.option
  				if option.to_s == current_answer.to_s
	  				points = @current_user.mini_points
  					current_answer_point = points + 10
            @current_user.update_attributes(:mini_points => current_answer_point)
            @mini_points = @current_user.minichallenge_points.build
            @mini_points.points = 10
            @mini_points.mini_challenge_id = @mc.id
            @mini_points.save
---
SELECT `mini_challenge_answers`.* FROM `mini_challenge_answers` WHERE (user_id = 2 and mini_challenge_id = '1')
SELECT `mini_challenges`.* FROM `mini_challenges` WHERE `mini_challenges`.`id` = 1 LIMIT 1
INSERT INTO `mini_challenge_answers` (`created_at`, `mini_challenge_id`, `updated_at`, `user_id`) VALUES ('2013-10-11 17:28:37', 1, '2013-10-11 17:28:37', 2)
SELECT `challenge_options`.* FROM `challenge_options` WHERE `challenge_options`.`mini_challenge_id` = 1 AND (answer = 1)
UPDATE `users` SET `mini_points` = 10, `updated_at` = '2013-10-11 17:44:02' WHERE `users`.`id` = 2
INSERT INTO `minichallenge_points` (`created_at`, `mini_challenge_id`, `points`, `updated_at`, `user_id`) VALUES ('2013-10-11 17:29:37', 5, 5, '2013-10-11 17:29:37', 2)