app/controllers/api/v1/sessions_controller.rb

  def create
    @user, message = User.authenticate(params[:email], params[:password])
    if @user.present?
      @auth_token = @user.create_token
      if @user.current_sign_in_at.present?
        unless @user.current_sign_in_at.to_date == Time.now.to_date
          points = @user.points.present? ? @user.points : 0
          login_points = points + 5
          @user.update_attributes(:points => login_points)
---
UPDATE `users` SET `current_sign_in_at` = '2013-10-10 21:40:04', `updated_at` = '2013-10-10 21:40:04' WHERE `users`.`id` = 2