app/controllers/api/v1/users_controller.rb

  def endorsement
    user_id = params[:endorse][:user_id]
    skill_id = params[:endorse][:skill_id]
    endorse_id = params[:endorse][:endorse_id]
    @user = User.find(user_id)
    @endorse = User.find(endorse_id)
    @skill = Skill.find(skill_id)
    if @endorse.is_player?
      if user_id.present? && skill_id.present? && endorse_id.present?
        old_ue = UserEndorse.where("user_id = ? and skill_id = ? and endorse_id = ?", user_id, skill_id, endorse_id)
        unless old_ue.present?
          u = UserEndorse.new(user_endorse)
          u.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `user_endorses`.* FROM `user_endorses` WHERE (user_id = '2' and skill_id = '11' and endorse_id = '3')
INSERT INTO `user_endorses` (`created_at`, `endorse_id`, `skill_id`, `updated_at`, `user_id`) VALUES ('2013-10-11 00:43:44', 3, 11, '2013-10-11 00:43:44', 2)