app/views/challenges/index.html.erb

  	<% @challenges.each do |challenge| %>
    <% if challenge.user.present? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

          <%= link_to "Video Challenge", edit_challenge_path(challenge) %>
        <% elsif challenge.document_challenge.present? && challenge.document_challenge.is_image_document? %>
---
SELECT `document_challenges`.* FROM `document_challenges` WHERE `document_challenges`.`challenge_id` = 1 ORDER BY `document_challenges`.`id` ASC LIMIT 1