app/views/challenges/show.html.erb

				<tr>
					<td><%= User.find(player.user_id).name %></td>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1