app/controllers/challenges_controller.rb

SELECT COUNT(*) FROM `challenges`
SELECT `challenges`.* FROM `challenges` LIMIT 10 OFFSET 0
---
	def index
		@challenges = Challenge.page(params[:page]).per(10)

SELECT `challenges`.* FROM `challenges` WHERE `challenges`.`id` = 1 LIMIT 1
SELECT `player_challenges`.* FROM `player_challenges` WHERE (challenge_id = 1)
---
	def show
		logger.warn("====testing==========")
		@player_challenges = PlayerChallenge.where("challenge_id = ?", @challenge.id)

SELECT `document_challenges`.* FROM `document_challenges` WHERE `document_challenges`.`challenge_id` = 1 ORDER BY `document_challenges`.`id` ASC LIMIT 1
SELECT `video_challenges`.* FROM `video_challenges` WHERE `video_challenges`.`challenge_id` = 1 ORDER BY `video_challenges`.`id` ASC LIMIT 1
---
	def edit
		@challenge.build_document_challenge unless @challenge.build_document_challenge.present?
		@challenge.build_video_challenge unless @challenge.build_video_challenge.present?

UPDATE `challenges` SET `is_published` = 1, `updated_at` = '2013-10-10 18:29:37' WHERE `challenges`.`id` = 1
---
	def update
		respond_to do |format|
       if @challenge.update(challenge_params)

SELECT `challenges`.* FROM `challenges` WHERE `challenges`.`id` = 1 LIMIT 1
---
	def set_challenge
    @challenge = Challenge.find(params[:id])