app/controllers/mini_challenges_controller.rb

	def create
		@mini_challenge = current_user.mini_challenges.build(mini_challenge_params)
		if @mini_challenge.valid?
			@mini_challenge.save
---
INSERT INTO `mini_challenges` (`created_at`, `question`, `title`, `updated_at`, `user_id`) VALUES ('2013-10-11 17:29:18', 'dsfsd ds sddsfsdf sef', 'just test', '2013-10-11 17:29:18', 2)

	def index
		@mini_challenges = MiniChallenge.page(params[:page]).per(10)
---
SELECT COUNT(*) FROM `mini_challenges`
SELECT `mini_challenges`.* FROM `mini_challenges` LIMIT 10 OFFSET 0