app/controllers/users_controller.rb

  def index
    if params[:search].present?
      @users = User.search2(params[:search]).page(params[:page]).per(10)
---
SELECT COUNT(*) FROM `users` WHERE (name LIKE '%testing%')
SELECT `users`.* FROM `users` WHERE (name LIKE '%testing%') LIMIT 10 OFFSET 0

  def scoreboard
    @player_challenges = PlayerChallenge.all
---
SELECT `player_challenges`.* FROM `player_challenges`